<?php

return [
    'attributes' => [
        'name' => 'Имя',
        'description' => 'Описание',
        'status' => 'Статус',
        'author' => 'Автор',
        'assigned_to' => 'Исполнитель',
        'labels' => 'Метки',
        'date' => 'Дата создания',
        'actions' => 'Действия',
    ],

    // Общие кнопки
    'buttons' => [
        'create' => 'Создать',
        'edit' => 'Изменить',
        'update' => 'Обновить',
        'delete' => 'Удалить',
        'login' => 'Вход',
        'register' => 'Регистрация',
        'logout' => 'Выход',
        'apply' => 'Применить',
    ],

    // Заголовки страниц
    'tasks' => [
        'index' => 'Задачи',
        'create' => 'Создать задачу',
        'edit' => 'Изменение задачи',
        'show' => 'Просмотр задачи',
        'empty' => 'Нет добавленных задач',
    ],
    'labels' => [
        'index' => 'Метки',
        'create' => 'Создать метку',
        'edit' => 'Изменение метки',
    ],
    'statuses' => [
        'index' => 'Статусы',
        'create' => 'Создать статус',
        'edit' => 'Изменение статуса',
    ],
    'welcome' => [
        'title' => 'Привет от Хекслета!',
        'subtitle' => 'Это простой менеджер задач на Laravel',
        'button' => 'Нажми меня',
    ],

    'app_name' => 'Менеджер задач',
];
